import React from 'react';

const Blogs = () => {
    return (
        <div className='w-full grid grid-cols-2 my-8 '>
            <div className='bg-slate-200 m-5 rounded-lg p-8'>
                <h1 className='py-3 text-2xl'>Question: Context Api কি এবং এটি কিভাবে কাজ করে?</h1>
                <p>Answer: সাধারণত আমরা একটা কম্পোনেন্ট থেকে আরেকটা কম্পোনেন্ট ডাটা সেন্ড করার জন্য প্যারেন্ট কম্পোনেন্ট থেকে চাইল্ড কম্পোনেন্ট এ প্রপ্স আকারে ডাটা  সেন্ড করি। তবে মাঝে মাঝে দেখা যায় যে চাইল্ড কম্পোনেন্ট ডাটা পাঠাতে চাই সেটা অনেক লেভেল নিচে থাকে। সেক্ষেত্রে ডাটা প্রপ্স আকারে পাঠাতে অনেক ঝামেলা মনে হবে। তবে আমরা প্রপ্স আকারে ডাটা না পাঠিয়েই চাইল্ড কম্পোনেন্ট গুলোতে ডাটা পাঠাতে পারি রিয়েক্ট এর context api দ্বারা। এটি দিয়ে আরো সহজ ভাবে কোনো ঝামেলা ছাড়াই গভীর নিচে থাকা কম্পোনেন্ট এ ডাটা সেন্ড করতে পারি।</p>
            </div>
            <div  className='bg-slate-200 m-5 rounded-lg p-8'>
                <h1  className='py-3 text-2xl' >Question: semantic ট্যাগ কি?</h1>
                <p>এইচটিএমএল ৫ আসার আগে আমরা অয়েব লেআউট  ডিভ দিয়ে বানাইতাম। যার ফলে সার্চ ইঞ্জিন গুলোর কোনটার ব্লগ আর কোনটা হেডার  বা কোন সাব লেআউট কি আছে এটা বুঝতে সমস্যা হতো।  তবে html 5 ভার্সন এ নতুন কিছু সিমেন্টিক ট্যাগ এড করা  হয়েছে এগুলা তাদের নিজস্ব অর্থ বহন করে। যেমন হেডিং এ আমরা header ট্যাগ ইউজ করি, আর্টিকেল লিখতে article ট্যাগ,সাইডবার বানাতে aside  ট্যাগ ব্যবহৃত হয়। এই সিমেন্টিক ট্যাগ গুলার কারণে ডেভলপার রা বা সার্চ ইঞ্জিন গুলো সহজেই বুঝতে পারে কোথায় কি আছে।</p>
            </div>
        </div>
    );
};

export default Blogs;